layer7CTF2020/forensic/Untitled-2.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">

    <soap:Header>

        <wsa:To>
        urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>

        <wsa:Action>
        http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>

        <wsa:MessageID>
        urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>

    </soap:Header>

    <soap:Body>

        <wsd:Resolve>

            <wsa:EndpointReference>

                <wsa:Address>
                urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>

            </wsa:EndpointReference>

        </wsd:Resolve>

    </soap:Body>

</soap:Envelope>
<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope><?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope><?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope><?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope><?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope><?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>
            urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>
            http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>
            urn:uuid:5da57784-72a4-49f5-8708-35c5acd901a7</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>
            urn:uuid:cfe92100-67c4-11d4-a45f-9caed3fa3eb9</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope>